Revit 2026 API

# Tab Enumeration

---

An enumerated type listing static tabs which support addition of panels via the API.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum Tab
```
```vb
Public Enumeration Tab
```
```cpp
public enum class Tab
```
```fsharp
type Tab
```

| Member name | Value | Description |
| --- | --- | --- |
| AddIns | 0 | The Add-Ins tab. |
| Analyze | 1 | The Analyze tab. |

#### Reference

Autodesk.Revit.UI Namespace